{
  "basics": {
    "name": "Kirill Milintsevich",
    "label": "Researcher (NLP / Medical AI)",
    "image": "",
    "email": "me@milintsevich.com",
    "phone": "",
    "url": "https://scholar.google.com/citations?user=BQNVCjYAAAAJ&hl=en",
    "summary": "Throughout my academic career, I have explored a range of topics within the field of NLP, including, but not limited to, low-resource languages, morphology, language generation, and mental health.",
    "location": {
      "city": "Caen",
      "countryCode": "FR"
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "BQNVCjYAAAAJ",
        "url": "https://scholar.google.com/citations?user=BQNVCjYAAAAJ&hl=en"
      },
      {
        "network": "LinkedIn",
        "username": "milintsevich",
        "url": "https://www.linkedin.com/in/milintsevich/"
      }
    ]
  },
  "work": [
    {
      "name": "TransPerfect",
      "position": "NLP Engineer",
      "startDate": "2022-05",
      "endDate": "2022-08",
      "summary": "Developing the inverse text normalization system for the automatic speech recognition pipeline."
    },
    {
      "name": "TransPerfect",
      "position": "Computational Linguist",
      "startDate": "2021-06",
      "endDate": "2021-09",
      "summary": "Developing the inverse text normalization system for the automatic speech recognition pipeline."
    }
  ],
  "education": [
    {
      "institution": "University of Caen & University of Tartu",
      "location": "Caen, France",
      "url": "",
      "area": "Computer Science",
      "studyType": "PhD",
      "startDate": "2020-10",
      "endDate": "2024-10"
    },
    {
      "institution": "University of Tartu",
      "location": "Tartu, Estonia",
      "url": "",
      "area": "Computer Science",
      "studyType": "MSc",
      "startDate": "2018-09",
      "endDate": "2020-08"
    },
    {
      "institution": "Higher School of Economics",
      "location": "Moscow, Russia",
      "url": "",
      "area": "Computational Linguistics",
      "studyType": "MA",
      "startDate": "2016-09",
      "endDate": "2018-08"
    },
    {
      "institution": "Far Eastern Federal University",
      "location": "Vladivostok, Russian",
      "url": "",
      "area": "Applied Linguistics",
      "studyType": "BA",
      "startDate": "2012-09",
      "endDate": "2016-08"
    }
  ],
  "publications": [
    {
      "name": "Analyzing Symptom-based Depression Level Estimation through the Prism of Psychiatric Expertise",
      "publisher": "Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024)",
      "releaseDate": "2024-05",
      "url": "https://aclanthology.org/2024.lrec-main.87",
      "summary": "The ever-growing number of people suffering from mental distress has motivated significant research initiatives towards automated depression estimation. Despite the multidisciplinary nature of the task, very few of these approaches include medical professionals in their research process, thus ignoring a vital source of domain knowledge. In this paper, we propose to bring the domain experts back into the loop and incorporate their knowledge within the gold-standard DAIC-WOZ dataset. In particular, we define a novel transformer-based architecture and analyse its performance in light of our expert annotations. Overall findings demonstrate a strong correlation between the psychological tendencies of medical professionals and the behavior of the proposed model, which additionally provides new state-of-the-art results."
    },
    {
      "name": "Evaluating Lexicon Incorporation for Depression Symptom Estimation",
      "publisher": "6th Clinical Natural Language Processing Workshop (Clinical NLP) at NAACL 2024",
      "releaseDate": "2024-06",
      "url": "https://aclanthology.org/2024.clinicalnlp-1.28",
      "summary": "This paper explores the impact of incorporating sentiment, emotion, and domain-specific lexicons into a transformer-based model for depression symptom estimation. Lexicon information is added by marking the words in the input transcripts of patient-therapist conversations as well as in social media posts. Overall results show that the introduction of external knowledge within pre-trained language models can be beneficial for prediction performance, while different lexicons show distinct behaviours depending on the targeted task. Additionally, new state-of-the-art results are obtained for the estimation of depression level over patient-therapist interviews."
    },
    {
      "name": "Your Model Is Not Predicting Depression Well And That Is Why: A Case Study of PRIMATE Dataset",
      "publisher": "9th Workshop on Computational Linguistics and Clinical Psychology (CLPsych 2024)",
      "releaseDate": "2024-03",
      "url": "https://aclanthology.org/2024.clpsych-1.13",
      "summary": "This paper addresses the quality of annotations in mental health datasets used for NLP-based depression level estimation from social media texts. While previous research relies on social media-based datasets annotated with binary categories, i.e. depressed or non-depressed, recent datasets such as D2S and PRIMATE aim for nuanced annotations using PHQ-9 symptoms. However, most of these datasets rely on crowd workers without the domain knowledge for annotation. Focusing on the PRIMATE dataset, our study reveals concerns regarding annotation validity, particularly for the lack of interest or pleasure symptom. Through reannotation by a mental health professional, we introduce finer labels and textual spans as evidence, identifying a notable number of false positives. Our refined annotations, to be released under a Data Use Agreement, offer a higher-quality test set for anhedonia detection. This study underscores the necessity of addressing annotation quality issues in mental health datasets, advocating for improved methodologies to enhance NLP model reliability in mental health assessments."
    }
  ],
  "languages": [
    {
      "language": "Russian",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "French",
      "fluency": "Fluent",
      "icon": ""
    }
  ]
}